Австралия/src/Documents/ReconciliationStatement/ReconciliationStatement.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ReconciliationStatement</name>
  <posting>Deny</posting>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>BeginOfPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndOfPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.ReconciliationStatementStatus</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CounterpartyRepresentative</name>
    <type>
      <types>CatalogRef.ContactPersons</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionContractsSelection</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BalanceBeginPeriod</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyVATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>CompanyData</name>
    <attributes>
      <name>DocumentDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DocumentNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AccountingDocument</name>
      <type>
        <types>DocumentRef.SalesInvoice</types>
        <types>DocumentRef.AccountSalesFromConsignee</types>
        <types>DocumentRef.SupplierInvoice</types>
        <types>DocumentRef.PaymentExpense</types>
        <types>DocumentRef.OtherExpenses</types>
        <types>DocumentRef.DebitNote</types>
        <types>DocumentRef.ExpenseReport</types>
        <types>DocumentRef.CashReceipt</types>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.ProductionOrder</types>
        <types>DocumentRef.CreditNote</types>
        <types>DocumentRef.AccountSalesToConsignor</types>
        <types>DocumentRef.CashVoucher</types>
        <types>DocumentRef.ArApAdjustments</types>
        <types>DocumentRef.PaymentReceipt</types>
        <types>DocumentRef.OpeningBalanceEntry</types>
        <types>DocumentRef.AdditionalExpenses</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CompanyDebtAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ClientDebtAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CounterpartyData</name>
    <attributes>
      <name>IncomingDocumentDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IncomingDocumentNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AccountingDocument</name>
      <type>
        <types>DocumentRef.SalesInvoice</types>
        <types>DocumentRef.AccountSalesFromConsignee</types>
        <types>DocumentRef.SupplierInvoice</types>
        <types>DocumentRef.PaymentExpense</types>
        <types>DocumentRef.OtherExpenses</types>
        <types>DocumentRef.DebitNote</types>
        <types>DocumentRef.ExpenseReport</types>
        <types>DocumentRef.CashReceipt</types>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.ProductionOrder</types>
        <types>DocumentRef.CreditNote</types>
        <types>DocumentRef.AccountSalesToConsignor</types>
        <types>DocumentRef.CashVoucher</types>
        <types>DocumentRef.ArApAdjustments</types>
        <types>DocumentRef.PaymentReceipt</types>
        <types>DocumentRef.OpeningBalanceEntry</types>
        <types>DocumentRef.AdditionalExpenses</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CompanyDebtAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ClientDebtAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Documents/ReconciliationStatement/Forms/CounterpartyContractsForm/Module.bsl
#Region ProcedureFormEventHandlers

&AtServer
// Procedure - OnCreateAtServer event handler.
//
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	StandardProcessing = False;
	
	Counterparty	= Parameters.Counterparty;
	Company			= Parameters.Company;
	
	CounterpartyContracts.Load(Parameters.CounterpartyContracts.Unload());
	
	CheckContractsFilling = False;
	
EndProcedure

&AtClient
// Procedure - event handler BeforeClose form.
//
Procedure BeforeClose(Cancel, Exit, WarningText, StandardProcessing)
	
	If Exit Then
		Return;
	EndIf;
	
	If CheckContractsFilling Then
	
		For Each Contract In CounterpartyContracts Do
			
			If Not ValueIsFilled(Contract.Contract) Then
				
				MessageText = NStr("en = 'There are rows with a blank counterparty contract in the table'; ru = 'В таблице присутствуют строки с незаполненным договором контрагента';pl = 'Tabela zawiera wiersze z niewypełnioną umową kontrahenta';es_ES = 'Hay filas con un contrato de la contraparte en blanco en la tabla';es_CO = 'Hay filas con un contrato de la contraparte en blanco en la tabla';tr = 'Tabloda boş cari hesap sözleşmesi olan satırlar var';it = 'Nella tabella ci sono linee con un contratto inevaso della controparte';de = 'In der Tabelle gibt es Zeilen mit einem leeren Geschäftspartnervertrag'");
				CommonClientServer.MessageToUser(MessageText, , , , Cancel);
				Break;
				
			EndIf;
			
		EndDo;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region CommandHandlers

&AtClient
// Procedure command handler OK
//
Procedure OK(Command)
	
	CheckContractsFilling = True;
	Modified = False;
	Close(New Structure("CounterpartyContracts", CounterpartyContracts));
	
EndProcedure

&AtClient
// Procedure command handler Cancel
//
Procedure Cancel(Command)
	
	CheckContractsFilling = False;
	Modified = False;
	Close();
	
EndProcedure

&AtClient
// Procedure command handler SelectCheckboxes
//
Procedure CheckAll(Command)
	
	For Each ListRow In CounterpartyContracts Do
		
		ListRow.Select = True;
		
	EndDo;
	
EndProcedure

&AtClient
// Procedure command handler SelectCheckboxes
//
Procedure UncheckAll(Command)
	
	For Each ListRow In CounterpartyContracts Do
		
		ListRow.Select = False;
		
	EndDo;
	
EndProcedure
// 

#EndRegion
